app/Controllers/TransaksiController.php

INSERT INTO `transaksi` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_by`, `created_date`) VALUES ('balaraja', '', '', '', 0, 'balaraja', '2023-07-01 15:10:13')
---
    public function buy()
    {
        if ($this->request->getPost()) {
            $data = $this->request->getPost();

            $transaksiModel = new \App\Models\TransaksiModel();
            $transaksiDetailModel = new \App\Models\TransaksiDetailModel();

            $dataForm = [
                'username' => $this->request->getPost('username'),
                'total_harga' => $this->request->getPost('total_harga'),
                'alamat' => $this->request->getPost('alamat'),
                'ongkir' => $this->request->getPost('ongkir'),
                'status' => 0,
                'created_by' => $this->request->getPost('username'),
                'created_date' => date("Y-m-d H:i:s")
            ];

            $transaksiModel->insert($dataForm);

INSERT INTO `transaksi_detail` (`id_transaksi`, `id_barang`, `jumlah`, `diskon`, `subtotal_harga`, `created_by`, `created_date`) VALUES (5, '1', 1, 0, 2500, 'balaraja', '2023-07-01 15:10:13')
---
                    'created_date' => date("Y-m-d H:i:s")
                ];

                $transaksiDetailModel->insert($dataFormDetail);