app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function user()
    {
        $data['users'] = $this->user->findAll();

INSERT INTO `user` (`username`, `password`, `role`, `is_aktif`) VALUES ('noobmaster69', '575e22bc356137a41abdef379b776dba', 'user', '1')
---
    public function store()
    {
        $data = [
            'name' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'username' => $this->request->getPost('username'),
            'password' => md5($this->request->getPost('password')),
            'role' => $this->request->getPost('role'),
            'is_aktif' => $this->request->getPost('is_aktif'),
        ];
        // $data = $this->request->getPost();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'username' => 'required',
            'password' => 'required',
            'is_aktif' => 'in_list[0,1]',
        ]);

        if ($validation->run($data)) {
            // Valid data, proceed to store in the database
            $this->userModel->insert($data);

SELECT *
FROM `user`
WHERE `user`.`id` = '6'
---
    public function delete($id)
    {
        // Lakukan validasi ID pengguna
        $validation = \Config\Services::validation();
        $validation->setRules([
            'id' => 'required|integer'
        ]);

        if (!$validation->run(['id' => $id])) {
            return redirect()->to('/user')->with('failed', 'ID pengguna tidak valid');
        }

        // Cari pengguna dengan ID yang diberikan
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($id);

UPDATE `user` SET `is_aktif` = 0
WHERE `user`.`id` IN ('6')
---
    public function activate($id)
    {
        $user = $this->user->find($id);

        if (!$user) {
            return redirect()->to('/user')->with('error', 'User not found.');
        }

        // Update the `is_aktif` field of the user to activate
        $this->user->update($id, ['is_aktif' => 1]);